БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Продажи/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Продажи за короткий период. Не желательна для получения оборотов более двух дней.
//
// Параметры:
//  ПараметрыОтбора	 - Структура - с ключем Дата и возможными ключами Номенклатура - Массив из СправочникСсылка.Номенклатура и Клиент - СправочникСсылка.Клиент.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с колонками Номенклатура, Клиент, Сотрудник, Количество.
//
Функция ПолучитьПродажиКороткогоПериода(ПараметрыОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ПараметрыОтбора.Дата));
	Запрос.УстановитьПараметр("ДатаКонца",  КонецДня(ПараметрыОтбора.Дата));
	
	Запрос.УстановитьПараметр("ЕстьОтборНоменклатура", ПараметрыОтбора.Свойство("Номенклатура"));
	Запрос.УстановитьПараметр("Номенклатура", ?(Запрос.Параметры.ЕстьОтборНоменклатура, ПараметрыОтбора.Номенклатура, Неопределено));
	
	Если ПараметрыОтбора.Свойство("Клиент")
		И ЗначениеЗаполнено(ПараметрыОтбора.Клиент)
	Тогда
		Запрос.УстановитьПараметр("Клиент", ПараметрыОтбора.Клиент);
	Иначе
		Запрос.УстановитьПараметр("Клиент", Неопределено);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Клиент КАК Клиент,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Продажи.Активность
	|	И (&Клиент = НЕОПРЕДЕЛЕНО
	|			ИЛИ Продажи.Клиент В (&Клиент))
	|	И (&ЕстьОтборНоменклатура = ЛОЖЬ
	|			ИЛИ Продажи.Номенклатура В (&Номенклатура))"
	;
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
